app/controllers/dictation_controller.rb

SELECT "dictations".* FROM "dictations" WHERE "dictations"."user_id" = 1 ORDER BY date
---
  def view
    @dictations = current_user.dictations.order(:date)

SELECT "dictations".* FROM "dictations"
---
  def show
    @dictations = Dictation.all